// function withdraw(amount, balance) {
//   if (amount === 0) {
//     console.log("Для проведення операції введіть суму більшу за нуль");
//   } else if (amount > balance) {
//     console.log("Недостатньо коштів на рахунку");
//   } else {
//     console.log("Операція зняття коштів проведена успішно");
//   }
// }

// withdraw(0, 300); // "Для проведення операції введіть суму більшу за нуль"
// withdraw(500, 300); // "Недостатньо коштів на рахунку"
// withdraw(100, 300); // "Операція зняття коштів проведена успішно"
//
//
function withdraw(amount, balance) {
  if (amount === 0) {
    return "Для проведення операції введіть суму більшу за нуль";
  }
  if (amount > balance) {
    return "Недостатньо коштів на рахунку";
  }
  ("Операція зняття коштів проведена успішно");
}
console.log(withdraw(0, 300));
